paper/get_set_benchmark/raw/idlekv-get-set-1-3.txt
4         Threads
64        Connections per thread
500000    Requests per client


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets      1829709.61          ---          ---         2.86190         2.25500        10.30300        19.32700    139173.40 
Gets      5489128.84    414713.98   5074414.86         2.86190         2.25500        10.30300        19.32700    222229.04 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals    7318838.45    414713.98   5074414.86         2.86190         2.25500        10.30300        19.32700    361402.45 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.031        0.000
SET       0.895        5.000
SET       1.079       10.000
SET       1.215       15.000
SET       1.343       20.000
SET       1.471       25.000
SET       1.591       30.000
SET       1.727       35.000
SET       1.879       40.000
SET       2.047       45.000
SET       2.255       50.000
SET       2.367       52.500
SET       2.495       55.000
SET       2.639       57.500
SET       2.783       60.000
SET       2.927       62.500
SET       3.087       65.000
SET       3.247       67.500
SET       3.407       70.000
SET       3.567       72.500
SET       3.759       75.000
SET       3.855       76.250
SET       3.951       77.500
SET       4.047       78.750
SET       4.159       80.000
SET       4.255       81.250
SET       4.383       82.500
SET       4.511       83.750
SET       4.639       85.000
SET       4.767       86.250
SET       4.927       87.500
SET       4.991       88.125
SET       5.087       88.750
SET       5.183       89.375
SET       5.279       90.000
SET       5.375       90.625
SET       5.471       91.250
SET       5.599       91.875
SET       5.727       92.500
SET       5.855       93.125
SET       6.015       93.750
SET       6.079       94.062
SET       6.175       94.375
SET       6.271       94.688
SET       6.367       95.000
SET       6.495       95.312
SET       6.623       95.625
SET       6.751       95.938
SET       6.911       96.250
SET       7.071       96.562
SET       7.263       96.875
SET       7.391       97.031
SET       7.519       97.188
SET       7.647       97.344
SET       7.807       97.500
SET       7.935       97.656
SET       8.127       97.812
SET       8.319       97.969
SET       8.575       98.125
SET       8.831       98.281
SET       9.023       98.438
SET       9.151       98.516
SET       9.343       98.594
SET       9.471       98.672
SET       9.663       98.750
SET       9.855       98.828
SET      10.047       98.906
SET      10.303       98.984
SET      10.559       99.062
SET      10.879       99.141
SET      11.199       99.219
SET      11.391       99.258
SET      11.519       99.297
SET      11.711       99.336
SET      11.903       99.375
SET      12.095       99.414
SET      12.287       99.453
SET      12.479       99.492
SET      12.735       99.531
SET      13.055       99.570
SET      13.311       99.609
SET      13.503       99.629
SET      13.759       99.648
SET      14.015       99.668
SET      14.207       99.688
SET      14.527       99.707
SET      14.847       99.727
SET      15.039       99.746
SET      15.359       99.766
SET      15.743       99.785
SET      16.127       99.805
SET      16.383       99.814
SET      16.639       99.824
SET      16.895       99.834
SET      17.279       99.844
SET      17.535       99.854
SET      17.791       99.863
SET      18.175       99.873
SET      18.431       99.883
SET      18.943       99.893
SET      19.327       99.902
SET      19.583       99.907
SET      19.839       99.912
SET      20.095       99.917
SET      20.351       99.922
SET      20.735       99.927
SET      20.991       99.932
SET      21.375       99.937
SET      21.759       99.941
SET      22.143       99.946
SET      22.527       99.951
SET      22.655       99.954
SET      22.911       99.956
SET      23.167       99.958
SET      23.423       99.961
SET      23.935       99.963
SET      24.191       99.966
SET      24.575       99.968
SET      24.959       99.971
SET      25.343       99.973
SET      25.855       99.976
SET      26.111       99.977
SET      26.367       99.978
SET      26.495       99.979
SET      26.751       99.980
SET      27.007       99.982
SET      27.263       99.983
SET      27.775       99.984
SET      28.031       99.985
SET      28.543       99.987
SET      28.927       99.988
SET      29.055       99.988
SET      29.311       99.989
SET      29.567       99.990
SET      29.695       99.990
SET      29.951       99.991
SET      30.463       99.991
SET      30.975       99.992
SET      31.487       99.993
SET      31.871       99.993
SET      32.127       99.994
SET      32.255       99.994
SET      32.383       99.995
SET      32.767       99.995
SET      33.023       99.995
SET      33.279       99.995
SET      33.279       99.996
SET      33.535       99.996
SET      33.791       99.996
SET      34.047       99.997
SET      34.815       99.997
SET      35.071       99.997
SET      35.071       99.997
SET      35.327       99.997
SET      35.583       99.998
SET      35.583       99.998
SET      35.839       99.998
SET      36.863       99.998
SET      37.119       99.998
SET      37.119       99.998
SET      37.119       99.998
SET      37.375       99.999
SET      37.375       99.999
SET      37.631       99.999
SET      37.887       99.999
SET      38.399       99.999
SET      38.655       99.999
SET      39.679       99.999
SET      39.935       99.999
SET      39.935       99.999
SET      40.703       99.999
SET      40.703       99.999
SET      40.959       99.999
SET      40.959       99.999
SET      41.471       99.999
SET      41.471       99.999
SET      41.471       99.999
SET      41.727      100.000
SET      41.727      100.000
SET      41.983      100.000
SET      41.983      100.000
SET      41.983      100.000
[...]
SET      42.239      100.000
SET      42.239      100.000
SET      42.239      100.000
[...]
SET      42.495      100.000
SET      42.495      100.000
SET      43.263      100.000
SET      43.775      100.000
SET      43.775      100.000
SET      44.031      100.000
SET      44.031      100.000
SET      44.031      100.000
[...]
SET      44.287      100.000
SET      44.287      100.000
SET      44.543      100.000
SET      44.543      100.000
SET      44.543      100.000
[...]
SET      45.567      100.000
SET      45.567      100.000
SET      45.567      100.000
SET      46.591      100.000
SET      46.591      100.000
SET      46.591      100.000
[...]
SET      46.847      100.000
SET      46.847      100.000
---
GET       0.031        0.000
GET       0.895        5.000
GET       1.079       10.000
GET       1.215       15.000
GET       1.343       20.000
GET       1.471       25.000
GET       1.591       30.000
GET       1.727       35.000
GET       1.879       40.000
GET       2.047       45.000
GET       2.255       50.000
GET       2.367       52.500
GET       2.495       55.000
GET       2.639       57.500
GET       2.783       60.000
GET       2.927       62.500
GET       3.087       65.000
GET       3.247       67.500
GET       3.407       70.000
GET       3.567       72.500
GET       3.759       75.000
GET       3.855       76.250
GET       3.951       77.500
GET       4.047       78.750
GET       4.159       80.000
GET       4.255       81.250
GET       4.383       82.500
GET       4.511       83.750
GET       4.639       85.000
GET       4.767       86.250
GET       4.927       87.500
GET       4.991       88.125
GET       5.087       88.750
GET       5.183       89.375
GET       5.279       90.000
GET       5.375       90.625
GET       5.471       91.250
GET       5.599       91.875
GET       5.727       92.500
GET       5.855       93.125
GET       6.015       93.750
GET       6.079       94.062
GET       6.175       94.375
GET       6.271       94.688
GET       6.367       95.000
GET       6.495       95.312
GET       6.623       95.625
GET       6.751       95.938
GET       6.911       96.250
GET       7.071       96.562
GET       7.263       96.875
GET       7.391       97.031
GET       7.519       97.188
GET       7.647       97.344
GET       7.807       97.500
GET       7.967       97.656
GET       8.127       97.812
GET       8.319       97.969
GET       8.575       98.125
GET       8.831       98.281
GET       9.023       98.438
GET       9.151       98.516
GET       9.343       98.594
GET       9.471       98.672
GET       9.663       98.750
GET       9.855       98.828
GET      10.047       98.906
GET      10.303       98.984
GET      10.559       99.062
GET      10.879       99.141
GET      11.199       99.219
GET      11.391       99.258
GET      11.519       99.297
GET      11.711       99.336
GET      11.903       99.375
GET      12.095       99.414
GET      12.287       99.453
GET      12.479       99.492
GET      12.735       99.531
GET      13.055       99.570
GET      13.311       99.609
GET      13.503       99.629
GET      13.759       99.648
GET      14.015       99.668
GET      14.207       99.688
GET      14.527       99.707
GET      14.847       99.727
GET      15.039       99.746
GET      15.359       99.766
GET      15.743       99.785
GET      16.127       99.805
GET      16.383       99.814
GET      16.639       99.824
GET      16.895       99.834
GET      17.279       99.844
GET      17.535       99.854
GET      17.791       99.863
GET      18.175       99.873
GET      18.431       99.883
GET      18.943       99.893
GET      19.327       99.902
GET      19.583       99.907
GET      19.839       99.912
GET      20.095       99.917
GET      20.351       99.922
GET      20.735       99.927
GET      20.991       99.932
GET      21.375       99.937
GET      21.759       99.941
GET      22.143       99.946
GET      22.527       99.951
GET      22.655       99.954
GET      22.911       99.956
GET      23.167       99.958
GET      23.423       99.961
GET      23.935       99.963
GET      24.191       99.966
GET      24.575       99.968
GET      24.959       99.971
GET      25.343       99.973
GET      25.727       99.976
GET      26.111       99.977
GET      26.367       99.978
GET      26.495       99.979
GET      26.751       99.980
GET      27.007       99.982
GET      27.263       99.983
GET      27.775       99.984
GET      28.031       99.985
GET      28.543       99.987
GET      28.927       99.988
GET      29.055       99.988
GET      29.311       99.989
GET      29.567       99.990
GET      29.695       99.990
GET      29.951       99.991
GET      30.463       99.991
GET      30.975       99.992
GET      31.487       99.993
GET      31.871       99.993
GET      32.127       99.994
GET      32.255       99.994
GET      32.383       99.995
GET      32.767       99.995
GET      33.023       99.995
GET      33.279       99.995
GET      33.279       99.996
GET      33.535       99.996
GET      33.791       99.996
GET      34.047       99.997
GET      34.815       99.997
GET      35.071       99.997
GET      35.071       99.997
GET      35.327       99.997
GET      35.583       99.998
GET      35.583       99.998
GET      35.839       99.998
GET      36.863       99.998
GET      37.119       99.998
GET      37.119       99.998
GET      37.119       99.998
GET      37.375       99.999
GET      37.375       99.999
GET      37.631       99.999
GET      37.887       99.999
GET      38.399       99.999
GET      38.655       99.999
GET      39.679       99.999
GET      39.935       99.999
GET      39.935       99.999
GET      40.703       99.999
GET      40.703       99.999
GET      40.959       99.999
GET      40.959       99.999
GET      41.471       99.999
GET      41.471       99.999
GET      41.471       99.999
GET      41.727      100.000
GET      41.727      100.000
GET      41.983      100.000
GET      41.983      100.000
GET      41.983      100.000
[...]
GET      42.239      100.000
GET      42.239      100.000
GET      42.239      100.000
[...]
GET      42.495      100.000
GET      42.495      100.000
GET      43.263      100.000
GET      43.775      100.000
GET      43.775      100.000
GET      43.775      100.000
[...]
GET      44.031      100.000
GET      44.031      100.000
GET      44.031      100.000
[...]
GET      44.287      100.000
GET      44.287      100.000
GET      44.543      100.000
GET      44.543      100.000
GET      44.543      100.000
[...]
GET      45.567      100.000
GET      45.567      100.000
GET      45.567      100.000
[...]
GET      46.591      100.000
GET      46.591      100.000
GET      46.591      100.000
GET      46.847      100.000
GET      46.847      100.000
---
WAIT      0.000      100.000